<a href="https://colab.research.google.com/github/sabinaML/Python_pandas_data_analytics/blob/main/%D0%91%D0%B8%D0%B1%D0%BB%D0%B8%D0%BE%D1%82%D0%B5%D0%BA%D0%B0%20Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Задание 1
Скачайте с сайта grouplens.org...movielens/ датасет любого размера. Определите, какому фильму было выставлено больше всего оценок 5.0.

In [ ]:
import pandas as pd

In [ ]:
movies = pd.read_csv('C:/ml-25m/movies.csv')
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [ ]:
df=pd.read_csv('C:/ml-25m/ratings.csv')
df.head()

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510

In [ ]:
df[df.rating == 5].groupby('movieId').agg({'rating': 'sum' }).reset_index().sort_values('rating', ascending=False)

       movieId    rating
313        318  197765.0
291        296  160845.0
350        356  129590.0
256        260  129020.0
2432      2571  127410.0
...        ...       ...
20062   147014       5.0
13545    89377       5.0
20064   147026       5.0
20065   147033       5.0
27132   209155       5.0

[27133 rows x 2 columns]

наибольшее кол-во оценок 5.0 у фильма №318

In [ ]:
movies[movies.movieId == 318]

     movieId                             title       genres
314      318  Shawshank Redemption, The (1994)  Crime|Drama

фильм - Shawshank Redemption, The (1994)

# Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [ ]:
power = pd.read_csv('C:/power.csv')
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [ ]:
pribaltica = ['Latvia','Estonia','Lithuania']
years = range(2005, 2011)
cat =[4,12,21]

In [ ]:
power[(power.country.isin(pribaltica))& (power.year.isin(years))& (power.category.isin(cat))].quantity.sum()

240481.0

# Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
www.finanz.ru...om-vremeni

In [ ]:
pd.read_html('https://fortrader.org/quotes')[1]

,Название,Цена,Изменение,Изменение(%),Обновлено
0,Нефть Brent Курс нефти сегодня,97.67,-5.98,-5.77,NaN
1,Нефть WTI Цены на нефть WTI,92.23,-2.86,-3.01,NaN
2,Природный газ Цена на природный газ,8.20,-0.11,-1.31,NaN
3,Кофе,205.75,0.00,0.00,NaN
4,Кукуруза,620.60,58.40,10.39,NaN
5,Соя,450.00,18.70,4.34,NaN
6,Хлопок,90.89,0.00,0.00,NaN

In [ ]:
pd.read_html('https://fortrader.org/quotes')[0]

                           Название   Цена  Изменение  Изменение(%)  Обновлено
0  EURRUB Курс евро к рублю сегодня  61.89       4.45          7.74        NaN
1       USDRUB Курс рубля к доллару  59.88       3.32          5.86        NaN